Revit 2027 API
ParameterTypeId.StairsRunEndWithRiser Property
 "End with Riser": End with Riser
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunEndWithRiser { get; }
Public Shared ReadOnly Property StairsRunEndWithRiser As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunEndWithRiser {
	ForgeTypeId^ get ();
}
static member StairsRunEndWithRiser : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace